CaoWenzhao/esp32s3_apo_dl_idf/firmware/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# A bit more headroom for the per-sensor tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Floating point is used heavily in the control loop; keep newlib nano off so
# printf("%f") works in logs.
CONFIG_NEWLIB_NANO_FORMAT=n

# BLE is the only phone control transport; Wi-Fi SoftAP is not started.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=247
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_MAX_BONDS=3

# The installed ESP32-S3 modules have 16 MB flash. BLE pushes the application
# beyond the original 1 MB factory partition.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
